Revit 2027 API
RenderingSettings.SetRenderingImageExposureSettings Method
 Changes the rendering image exposure settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRenderingImageExposureSettings(
	RenderingImageExposureSettings exposure
)
Public Sub SetRenderingImageExposureSettings (
	exposure As RenderingImageExposureSettings
)
public:
void SetRenderingImageExposureSettings(
	RenderingImageExposureSettings^ exposure
)
member SetRenderingImageExposureSettings :
        exposure : RenderingImageExposureSettings -> unit
Parameters
exposure RenderingImageExposureSettings
 An instance of the new rendering image exposure settings.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace